In [1]:
! pip install pandas

Requirement already satisfied: pandas in c:\users\jsgok\appdata\local\programs\python\python38-32\lib\site-packages (1.0.5)
Requirement already satisfied: pytz>=2017.2 in c:\users\jsgok\appdata\local\programs\python\python38-32\lib\site-packages (from pandas) (2020.1)
Requirement already satisfied: python-dateutil>=2.6.1 in c:\users\jsgok\appdata\local\programs\python\python38-32\lib\site-packages (from pandas) (2.8.1)
Requirement already satisfied: numpy>=1.13.3 in c:\users\jsgok\appdata\local\programs\python\python38-32\lib\site-packages (from pandas) (1.19.1)
Requirement already satisfied: six>=1.5 in c:\users\jsgok\appdata\roaming\python\python38\site-packages (from python-dateutil>=2.6.1->pandas) (1.14.0)

In [2]:
# pandas are cross between list and dictionary

In [5]:
import pandas as pd 
pd.Series?

In [6]:
animals=["lion","elephant","values"]
pd.Series(animals)

0        lion
1    elephant
2      values
dtype: object

In [7]:
# by default pandas sets it values to ibject

In [8]:
numbers=[1,2,3,4,5,6]
pd.Series(numbers)

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [9]:
animals=["lion","tiger","sdissdjs",None]
pd.Series(animals)

0        lion
1       tiger
2    sdissdjs
3        None
dtype: object

In [10]:
numbers=[1,2,3,4,5,6,None]
pd.Series(numbers)

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
5    6.0
6    NaN
dtype: float64

In [12]:
# nan != None
import numpy as np
np.nan == None

False

In [13]:
# when u do an equality test of itself then it gives u false itself 
np.nan == np.nan

False

In [14]:
# nan =not an number 
#  we have to test special library to check not an number 
#  when ever u see a nan its similiar to None but numberic value is diffrent because of efficiency reasons 
np.isnan(np.nan)

True

In [15]:
sports={
    "alen":"basketball",
    "gokul":"football",
    "absk":"tennies",
    "hari":"cricket",
}
sports

{'alen': 'basketball',
 'gokul': 'football',
 'absk': 'tennies',
 'hari': 'cricket'}

In [19]:
s=pd.Series(sports)
s

alen     basketball
gokul      football
absk        tennies
hari        cricket
dtype: object

In [21]:
# getting the index object \
s.index

Index(['alen', 'gokul', 'absk', 'hari'], dtype='object')

In [22]:
#  we can pass index values seperatly 
s=pd.Series(["gokul","jsgokul123@gmail.com","12121221"],index=["name","email","password"])
s

name                       gokul
email       jsgokul123@gmail.com
password                12121221
dtype: object

In [32]:
# note when u add an index list seperatly but u dont have the index pandas will automatically pass none or nan value

In [33]:
values={
    "archery":"india",
    "nba":"america",
    "cricket":"england"
}
v=pd.Series(values)
v

archery      india
nba        america
cricket    england
dtype: object

In [34]:
# if u want to see the fourth country on this
v.iloc[2]

'england'

In [35]:
#  now if u want to see which country uses nba as national sport we use loc attribuite 
v.loc["nba"]

'america'

In [40]:
# iloc and loc are attributes not methods thats why we use [] insted of ()

In [45]:
s=pd.Series([500.0,300.0,200.0,500.0])
s

0    500.0
1    300.0
2    200.0
3    500.0
dtype: float64

In [47]:
total=0
for item in s:
    total+=item
print(total)

1500.0

In [48]:
# pandas and underlying numoy library support a method of computation called vectorization
# vactorization works with most of the numpy library including the sum function

In [49]:
import numpy as np

In [51]:
total=np.sum(s)
print(total)

1500.0

In [54]:
# it creates a random values of 10000 numbers and values ranges between(0.1000)
s=pd.Series(np.random.randint(0,1000,10000))
print(s)

0       521
1       402
2       955
3        75
4       398
       ...
9995    922
9996    729
9997    123
9998    140
9999    474
Length: 10000, dtype: int32

In [55]:
s.head() 
# it reduces the output to first five value s

0    521
1    402
2    955
3     75
4    398
dtype: int32

In [58]:
len(s)

10000

In [59]:
# celluar magic functions which starts with two percentages sigans 
#  timeit which is going to run our code few times and give out average time taken to run the code

In [60]:
%%timeit -n 100
summary=0
for item in s:
    summary=summary+item

2.09 ms ± 23.7 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [61]:
%%timeit -n 100
summary=np.sum(s)

90 µs ± 9.24 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [ ]:
# as u observe above solving problems using numpy library is faster than the normal problem

In [62]:
s

0       521
1       402
2       955
3        75
4       398
       ...
9995    922
9996    729
9997    123
9998    140
9999    474
Length: 10000, dtype: int32

In [63]:
s=s+2
s.head()

0    523
1    404
2    957
3     77
4    400
dtype: int32

In [74]:
%%timeit -n 10
s=pd.Series(np.random.randint(0,1000,1000))
for label,value in s.iteritems():
    s.loc[label]=value+2

53.6 ms ± 701 µs per loop (mean ± std. dev. of 7 runs, 10 loops each)

In [76]:
%%timeit -n 10
s=pd.Series(np.random.randint(0,1000,1000))
s=s+2

244 µs ± 19.9 µs per loop (mean ± std. dev. of 7 runs, 10 loops each)

In [79]:
s=pd.Series([1,2,3,4])
s.loc['animal']="lion"

In [80]:
s

0            1
1            2
2            3
3            4
animal    lion
dtype: object

In [81]:
sports

{'alen': 'basketball',
 'gokul': 'football',
 'absk': 'tennies',
 'hari': 'cricket'}

In [84]:
sports2=pd.Series(["js","sdjdj","kkk"],index=["sdsd","sdsdsd","sdsdsds"])
sports2

sdsd          js
sdsdsd     sdjdj
sdsdsds      kkk
dtype: object

In [87]:
final=sports.append(sportss2)

AttributeError: 'dict' object has no attribute 'append'

In [ ]:
# pandas two dimensional data structure called as data frame

In [89]:
# the datafram data structure

In [90]:
import pandas as pd

In [109]:
purchase1=pd.Series({
    "name":"gokuljs",
    "item_purchased":"video game",
    "cost":22.50
})
purchase2=pd.Series({
    "name":"gok",
    "item_purchased":"video",
    "cost":22.5
})
purchase3=pd.Series({
    "name":"guljs",
    "item_purchased":" game",
    "cost":22.0
})

df=pd.DataFrame([purchase1,purchase2,purchase3],index=['store1','store2','store3'])
df.head()

           name item_purchased  cost
store1  gokuljs     video game  22.5
store2      gok          video  22.5
store3    guljs           game  22.0

In [110]:
df.loc['store2']

name                gok
item_purchased    video
cost               22.5
Name: store2, dtype: object

In [111]:
df["item_purchased"]

store1    video game
store2         video
store3          game
Name: item_purchased, dtype: object

In [112]:
df["cost"]

store1    22.5
store2    22.5
store3    22.0
Name: cost, dtype: float64

In [114]:
df.loc["store1","cost"]

22.5

In [115]:
# transpose of matrix happens 
df.T

                    store1 store2 store3
name               gokuljs    gok  guljs
item_purchased  video game  video   game
cost                  22.5   22.5     22

In [116]:
df.T.loc["cost"]

store1    22.5
store2    22.5
store3      22
Name: cost, dtype: object

In [121]:
df.loc[:,["name","cost"]]

           name  cost
store1  gokuljs  22.5
store2      gok  22.5
store3    guljs  22.0

In [122]:
#  dropping values inside the datafram 
# we use drop function to drop a row inside the dataframe 
# drop.("indexname")
df.drop("store2")

           name item_purchased  cost
store1  gokuljs     video game  22.5
store3    guljs           game  22.0

In [123]:
copy_df=df.copy()
copy_df=copy_df.drop("store1")

In [124]:
copy_df

         name item_purchased  cost
store2    gok          video  22.5
store3  guljs           game  22.0

In [125]:
# dropping a column inside the key word 
# del copy_df["column name"]
del copy_df["name"]

In [126]:
copy_df

       item_purchased  cost
store2          video  22.5
store3           game  22.0

In [127]:
df["location"]="none"

In [128]:
df

           name item_purchased  cost location
store1  gokuljs     video game  22.5     none
store2      gok          video  22.5     none
store3    guljs           game  22.0     none

In [129]:
import numpy as np

In [131]:
p=pd.Series(np.arange(1,50))
p

0      1
1      2
2      3
3      4
4      5
5      6
6      7
7      8
8      9
9     10
10    11
11    12
12    13
13    14
14    15
15    16
16    17
17    18
18    19
19    20
20    21
21    22
22    23
23    24
24    25
25    26
26    27
27    28
28    29
29    30
30    31
31    32
32    33
33    34
34    35
35    36
36    37
37    38
38    39
39    40
40    41
41    42
42    43
43    44
44    45
45    46
46    47
47    48
48    49
dtype: int32

In [132]:
k=pd.DataFrame([p],index=["cost"])

In [135]:
k=k.T
k

    cost
0      1
1      2
2      3
3      4
4      5
5      6
6      7
7      8
8      9
9     10
10    11
11    12
12    13
13    14
14    15
15    16
16    17
17    18
18    19
19    20
20    21
21    22
22    23
23    24
24    25
25    26
26    27
27    28
28    29
29    30
30    31
31    32
32    33
33    34
34    35
35    36
36    37
37    38
38    39
39    40
40    41
41    42
42    43
43    44
44    45
45    46
46    47
47    48
48    49

In [138]:
k["cost"]*=1.8
k

     cost
0    1.44
1    2.88
2    4.32
3    5.76
4    7.20
5    8.64
6   10.08
7   11.52
8   12.96
9   14.40
10  15.84
11  17.28
12  18.72
13  20.16
14  21.60
15  23.04
16  24.48
17  25.92
18  27.36
19  28.80
20  30.24
21  31.68
22  33.12
23  34.56
24  36.00
25  37.44
26  38.88
27  40.32
28  41.76
29  43.20
30  44.64
31  46.08
32  47.52
33  48.96
34  50.40
35  51.84
36  53.28
37  54.72
38  56.16
39  57.60
40  59.04
41  60.48
42  61.92
43  63.36
44  64.80
45  66.24
46  67.68
47  69.12
48  70.56

In [2]:
import pandas as pd

In [3]:
df=pd.read_csv('olympics.csv')
df.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15
0,NaN,№ Summer,01 !,02 !,03 !,Total,№ Winter,01 !,02 !,03 !,Total,№ Games,01 !,02 !,03 !,Combined total
1,Afghanistan (AFG),13,0,0,2,2,0,0,0,0,0,13,0,0,2,2
2,Algeria (ALG),12,5,2,8,15,3,0,0,0,0,15,5,2,8,15
3,Argentina (ARG),23,18,24,28,70,18,0,0,0,0,41,18,24,28,70
4,Armenia (ARM),5,1,2,9,12,6,0,0,0,0,11,1,2,9,12

In [4]:
df

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15
0,NaN,№ Summer,01 !,02 !,03 !,Total,№ Winter,01 !,02 !,03 !,Total,№ Games,01 !,02 !,03 !,Combined total
1,Afghanistan (AFG),13,0,0,2,2,0,0,0,0,0,13,0,0,2,2
2,Algeria (ALG),12,5,2,8,15,3,0,0,0,0,15,5,2,8,15
3,Argentina (ARG),23,18,24,28,70,18,0,0,0,0,41,18,24,28,70
4,Armenia (ARM),5,1,2,9,12,6,0,0,0,0,11,1,2,9,12
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
143,Independent Olympic Participants (IOP) [IOP],1,0,1,2,3,0,0,0,0,0,1,0,1,2,3
144,Zambia (ZAM) [ZAM],12,0,1,1,2,0,0,0,0,0,12,0,1,1,2
145,Zimbabwe (ZIM) [ZIM],12,3,4,1,8,1,0,0,0,0,13,3,4,1,8
146,Mixed team (ZZX) [ZZX],3,8,5,4,17,0,0,0,0,0,3,8,5,4,17
147,Totals,27,4809,4775,5130,14714,22,959,958,948,2865,49,5768,5733,6078,17579